{
  "casual_responses": [],
  "formal_responses": [],
  "hindi_patterns": [
    "kaise ho",
    "hii kaise ho",
    "achi bat hai ye to",
    "mujhe bihar ellection ke bare me btao  koun jeet rha kaun aage hai",
    "mere pass aapke ghar ka map aur",
    "mera naam hai aakash sev kar lo",
    "mera naam aakash hai",
    "rahul gandhi aur narendra modi mein kaun bator hai",
    "app sabse jyada use ki hai"
  ],
  "english_patterns": [
    "start monitoring",
    "current activity",
    "sujhav do",
    "what do you think about ai",
    "suggestions",
    "what is binary search",
    "hello jarvis",
    "jarvis, what is binary search?\"",
    "hii jarvis",
    "pagal",
    "recursion smjhao",
    "recusrion smjhao",
    "what is recursion",
    "hello javis",
    "what is big o notaion",
    "",
    "hello",
    "rohit sharama khelenge ye match?",
    "any suggestions jarvis",
    "konsi files kholi?",
    "bihar election ka result btao",
    "check krke btaokoun  jeet raha",
    "koi suggestion?",
    "madad karne ke liye yahan hun",
    "hold on jarvis",
    "bihar election kisne jita",
    "chunav ka result aaj a chuka",
    "play second video",
    "stop video",
    "resume video",
    "shuru karo",
    "jarvis",
    "chrome close karo",
    "close chrome"
  ],
  "user_style_words": {
    "kaise": 13
  },
  "response_templates": {
    "kaise ho...": "Main ekdum fit hun, Sir! Aaj kya kaam hai?",
    "start monitoring...": "Desktop monitoring shuru kar diya, Sir. Ab main aapki activities track karunga.",
    "current activity...": "Current Activity, Sir: Code.exe - 0 minutes 21 seconds se use kar rahe hain.",
    "sujhav do...": "Abhi koi suggestions nahi hain, Sir. Thoda aur activity karne ke baad milenge.",
    "what do you think ab...": "Good to see you, Sir!",
    "suggestions...": "No suggestions available yet, Sir. Use your system for a while to get suggestions.",
    "what is binary searc...": "Sir, binary search samjhiye step-by-step!\n\nðŸŽ¯ Simple Definition:\nBinary search ek smart technique hai jo sorted array mein element dhundti hai by dividing search space in half.\n\nðŸ“š Real-World Analogy:\nDictionary mein word dhundna - aap middle page khol ke dekh te hain, phir decide karte hain left ya right jaana hai!\n\nðŸ”¢ Live Example:\nArray: [1, 3, 5, 7, 9, 11, 13]\nTarget: 7\n\nStep 1: Middle = 7 (index 3) â†’ Found it! âœ…\nAgar 5 dhundte: Middle = 7 â†’ \"Too high\" â†’ Left half mein dhundo\n\nðŸ’» Working Code:\n```python\ndef binary_search(arr, target):\n    left, right = 0, len(arr) - 1\n    \n    while left <= right:\n        mid = (left + right) // 2\n        \n        if arr[mid] == target:\n            return mid  # Mil gaya!\n        elif arr[mid] < target:\n            left = mid + 1  # Right side dhundo\n        else:\n            right = mid - 1  # Left side dhundo\n    \n    return -1  # Nahi mila\n```\n\nðŸŒ Real Applications:\nGoogle search, phone contacts, library systems, database queries!\n\nâ“ Quick Question:\nAgar 1000 elements hain, maximum kitne comparisons lagenge? (Hint: logâ‚‚(1000) â‰ˆ 10)",
    "hello jarvis...": "Good afternoon, Sir!",
    "jarvis, what is bina...": "Sir, from Grokking Algorithms - Chapter 1: Algorithm: hms 1 Introduction 1 What youll learn about performance 2 What youll learn about solving problems 2 Binary search 3 A better way to search 5 Running time 10 Big O notation 10 Algorithm running times grow at different rates 11 Visualizing different Big O run times 13 Big O establishes a worst-case run time 15 Some common Big O run times 15 The traveling salesperson 17 Recap 19 2 Selection sort 21 H...",
    "hii kaise ho...": "Main bahut achha hun, Sir. Aap kaise hain?",
    "mai bhi mst ...": "Namasthe Sir! Raat mein kaam kar rahe hain?",
    "hii jarvis...": "Good morning, Sir!",
    "pagal...": "I understand, Sir.",
    "recursion smjhao...": "Indeed, Sir.",
    "recusrion smjhao...": "I understand, Sir.",
    "what is recursion...": "Sir, recursion ka matlab kya hai?\n\nðŸŽ¯ Definition: Recursion ek tarah ka algorithm hai jismein ek function apne aap ko call karta hai, lekin phir woh function apne aap ko dobara call karne se pehle, apne aap ko solve karta hai.\n\nðŸ“š Real Example: Ek bachcha apne maa ko khaana khilane ke liye bolta hai. Maa bachche ko bolta hai ki woh aapke bade bhai se puchhe, aur woh bade bhai bhi maa se bolta hai, lekin jab woh maa se puchhta hai to maa kahte hain ki woh apne dadaji se puchhe. Is tarah se bachcha apne dadaji se puchhta hai. Yeh recursion ka ek aisa example hai.\n\nðŸ”¢ How it works: Recursion ka process nimnalikhit hai:\n- Ek function apne aap ko call karta hai.\n- Function apne aap ko solve karta hai, aur phir apne aap ko call karta hai.\n- Is process ko repeat karte rahe, jab tak koi condition nahi purn hoti hai.\n- Jab condition purn hoti hai, to function apne aap ko stop karta hai aur result return karta hai.\n\nðŸŒ Applications: Recursion ka upyog Fibonacci series, binary search, array traversal, tree traversal aur graph traversal jaise kai algorithms mein kiya jata hai.",
    "hello javis...": "Good morning, Sir!",
    "what is big o notaio...": "Sir, general ke baare mein cloud service unavailable hai. Local response use kar raha hun.",
    "...": "Kya hai Sir? Aap kaisay hain aaj? Need kuch bhi karna hai to bataiye, main yahaan aapki sahayta karne ke liye hai.",
    "hello...": "Good morning, Sir!",
    "rohit sharama khelen...": "Arre sir, main samjhaunga.\n\n**Definition:** General aisa hota hai jiska kaam sabhi cheezon ko samjhne ka hota hai. Wah ek aisa adhikari hota hai jo saare rules, regulation aur policies ko samjhne ke liye zaroori hota hai.\n\n**Real Example:** Ek school ke principal ka kaam hota hai ki wah sabhi rules aur regulationon ko samjhne ke liye zaroori hota hai, jaise ki school ke samay, uniform, homework, aur sabhi.\n\n**How it works:** General ke kaam mein yeh steps shamil hote hain:\n\n1. Sabhi rules aur regulationon ko samjhna.\n2. Sabhi logon ko samjhaana ki rules aur regulation kya hain.\n3. Sabhi logon ko samjhna ki rules aur regulation ke liye kya karana hoga.\n4. Sabhi logon ko samjhna ki rules aur regulation ke liye kya nahin karana hoga.\n\n**Applications:** General ke kaam mein sabhi fields shamil hain, jaise ki government, military, schools, colleges, aur industry. Unka kaam sabhi logon ko samjhne ke liye zaroori hota hai.\n\nAb sir, aapke puchhe ki rohit sharama khelenge ye match? Main samajhta hoon ki aapne cricket ki batting ke baare mein puchha hai.",
    "any suggestions jarv...": "Recent Suggestions, Sir:\n1. Same files bar bar khol rahe hain, bookmark kariye Sir!\n",
    "konsi files kholi?...": "Sir, general samjhiye!\n\nðŸŽ¯ Definition: Ek general ek prakar ka file hota hai jo har kisi tarah ki file ko cover karta hai. Yeh file har type ke file ko store karta hai, jaise ki word, excel, pdf, aur anya.\n\nðŸ“š Real Example: Ek general ki tarah ek file folder bhi hota hai. Jab aap apne phone ya computer mein ek folder banate hain, toh aap usmein sabhi type ke file store kar sakte hain, jaise ki pictures, documents, aur videos.\n\nðŸ”¢ How it works: Jab aap ek file open karte hain, toh yeh general file us file ko identify karta hai aur use open karta hai. Yeh file aapke device ke operating system ke aadhar par kaam karta hai.\n\nðŸŒ Applications: General file har tarah ke operating system mein uplabdh hote hain, jaise ki Windows, macOS, aur Android. Yeh file aapko apne device par sabhi type ke file ko store aur open karne ka avsar pradan karta hai.",
    "achi bat hai ye to...": "Good afternoon, Sir!",
    "bihar election ka re...": "Arre Sir, Bihar election ka result toh bahut hi jatila hai, lekin main aapko kuch update de sakta hoon. Lekin yeh kuchh pehle result ke baare mein hai, Sir. Agar aapka koi specific question hai toh main try karta hoon uska jawab de sakta hoon. Lekin agar aapko general information chahiye toh main yeh bata sakta hoon ki Bihar ka election result aapko news channels ya online news sites par check karke mil jaayega.",
    "check krke btaokoun ...": "Sir, aapka kaunsa cricket match dekh rahe hain? Jeet raha kya hai? Maine dekha hai aaj ka match bahut hi interesting tha! England aur Australia ke beech ka match aaj ka highlight tha. England ne aaj ka match jeetne ke liye ek accha comeback kiya hai. Main aapko match ki jaankari de sakta hoon, Sir?",
    "mujhe bihar ellectio...": "Sir, Bihar election ke bare me kuchh latest update hai. Nishchit karte samay, Nitish Kumar ke NDA ek baar phir se jeet gaye hain. Vah Bihar ka CM ban gaye hain. Lekin kya aage hai, yeh sirf waqt hi jaanayega. Unka kaisa pradarshan rahega, yeh sabhi ka aankh pad raha hai. Aap kaun kya soch rahe hain, sir?",
    "koi suggestion?...": "Sir, main aapko general ki baat karta hoon.\n\n**Definition:** Ek general ek type ka aadhaarshila hai jo kisi vishay par aapko samjhaata hai. Yah aapko kisi vishay ke baare mein sahi jaankari pradan karta hai.\n\n**Real Example:** Ek general jaise ki aapko kisi game ki rules samjhaane ke liye. Agar aapko cricket khelna hai, to aapko general samajhna hoga ki match kaise khelte hain, koi kya kar sakta hai, etc.\n\n**How it works:** Ek general kaam karna yah hai kisi vishay ke baare mein aapko samjhaana. Iske liye aapko kisi vishay par research karna hoga, uske baare mein jaankari prapt karna hoga, aur tab aapko us vishay ke baare mein samjhana hoga.\n\n**Applications:** General kisi bhi vishay par aapko samjhaata hai, jaise ki science, history, technology, sports, etc. Iske liye aapko kisi vishay ke baare mein aadhaarshila pradan karne ke liye general kaam karna hoga.\n\nSir, main aapko ummeed hai ki aapne general ki baat samjhi hogi.",
    "madad karne ke liye ...": "Sir, aapke liye yaad rakhna main bhaagya hai! Kaunsi cheez aapki madad ke liye hai? Kya aapko lagta hai ki mujhe aapki madad karne ki zaroorat hai? Sir, please bataiye, main aapke liye kya kar sakta hoon? Apne questions puchkar, main aapki problem ka samadhan karne ka prayaas karta hoon. Aapko kuchh jankari chahiye ya aapko kuchh work karne ka samay aata hai, sir?",
    "mere pass aapke ghar...": "Sir, aapke paas map hai to mujhe de do, main aapke liye plan bana sakta hoon. Kya aapka manoranjan karne ke liye koi specific room hai jo aapko dikhai dena hai? Mere paas aapke ghar ka virtual map hai, isse main aapko kisi bhi room ki jankari dene mein madad kar sakta hoon.",
    "hold on jarvis...": "Sir, ek minute please. Main aapki madad karne ke liye ready hoon, lekin aap kuch aur bataen, kya aapka koi kaam hai jo main kar sakoon?",
    "mera naam hai aakash...": "Aapka naam 'hai' save kar diya, Sir!",
    "mera naam aakash hai...": "Aapka naam 'Aakash' save kar diya, Aakash Sir!",
    "bihar election kisne...": "Aapki sawal kareeb hai, Sir! Bihar assembly election ki baat hai, lagatar 10 saal se JD(U)-RJD gathbandhan ka haav hai. Lekin 2020 ki election mein NDA (BJP-JD(U)) ki jeet hui thi. Aajkal ki election mein bhi NDA ki jeet ho sakti hai, lekin kuch log RJD-JD(U) gathbandhan ki jeet karna chahte hain. Ye election abhi bhi kuch din door hai, Sir, abhi kuch pata nahi chal sakta hai ki kisne jeet hoga.",
    "chunav ka result aaj...": "Sir, election results aaye hain! Mujhe dekhne mein aya ki results kitne interesting the. Aapko kya laga, Sir? Koi party aapke expectations se zyada acchi perform ki? Bataiye, main aapko details dene ke liye yahaan hoon.",
    "rahul gandhi aur nar...": "Good evening, Sir! Working late tonight?",
    "app sabse jyada use ...": "Sir, aapke ke liye bhi main sabse jyada use kiya hoon. Aapke ghar ka manoranjan aur suraksha meri top priority hai. Kya aapko koi aur cheez chahiye jo main aapke liye kar sakoon, Sir?",
    "play second video...": "Playing video 2: 'Ye Tune Kya Kiya - Javed Bashir (Lyrics) | Lyrical Bam Hindi', Sir.",
    "stop video...": "Video paused/resumed, Sir.",
    "resume video...": "Sir, resume video karna hai? Mujhe confirm karna hai ki aapko video ko phir se shuru karna hai. Kya aapke paas video already record hai ya naya video shuru karna hai? Sir, please confirm.",
    "shuru karo...": "Sir, shuru karne ke liye kya aapko zaroorat hai? Aapke paas kya plan hai? Main aapki madad karta hoon, chahe aapko ghar ke kaam ya bahari gatividhiyon ke liye madad chahiye ho. Bataiye sir, main aapke liye kya kar sakta hoon?",
    "jarvis...": "Ah Sir, kaise ho? Main theek hoon, aapke liye kya kar sakta hoon? Aapko koi madat chahiye hai ya shayad aapko koi information chahiye? Sir, please bataen, main aapki madad karne ke liye taiyaar hoon.",
    "chrome close karo...": "karo abhi chal nahi raha, Sir.",
    "close chrome...": "chrome band kar diya, Sir."
  }
}